Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Yusuf Ali.tmx
Source language: ar
Languages: en

source: ولو أن للذين ظلموا ما في الأرض جميعا ومثله معه لافتدوا به من سوء العذاب يوم القيامة وبدا لهم من الله ما لم يكونوا يحتسبون
en: Even if the wrong-doers had all that there is on earth, and as much more, (in vain) would they offer it for ransom from the pain of the Penalty on the Day of Judgment: but something will confront them from Allah, which they could never have counted upon!

source: وبدا لهم سيئات ما كسبوا وحاق بهم ما كانوا به يستهزئون
en: For the evils of their Deeds will confront them, and they will be (completely) encircled by that which they used to mock at!

source: فإذا مس الإنسان ضر دعانا ثم إذا خولناه نعمة منا قال إنما أوتيته على علم بل هي فتنة ولكن أكثرهم لا يعلمون
en: Now, when trouble touches man, he cries to Us: But when We bestow a favour upon him as from Ourselves, he says, "This has been given to me because of a certain knowledge (I have)!" Nay, but this is but a trial, but most of them understand not!

source: قد قالها الذين من قبلهم فما أغنى عنهم ما كانوا يكسبون
en: Thus did the (generations) before them say! But all that they did was of no profit to them.

source: فأصابهم سيئات ما كسبوا والذين ظلموا من هؤلاء سيصيبهم سيئات ما كسبوا وما هم بمعجزين
en: Nay, the evil results of their Deeds overtook them. And the wrong-doers of this (generation)- the evil results of their Deeds will soon overtake them (too), and they will never be able to frustrate (Our Plan)!

source: أولم يعلموا أن الله يبسط الرزق لمن يشاء ويقدر إن في ذلك لآيات لقوم يؤمنون
en: Know they not that Allah enlarges the provision or restricts it, for any He pleases? Verily, in this are Signs for those who believe!

source: قل يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله إن الله يغفر الذنوب جميعا إنه هو الغفور الرحيم
en: Say: "O my Servants who have transgressed against their souls! Despair not of the Mercy of Allah: for Allah forgives all sins: for He is Oft-Forgiving, Most Merciful.

source: وأنيبوا إلى ربكم وأسلموا له من قبل أن يأتيكم العذاب ثم لا تنصرون
en: "Turn ye to our Lord (in repentance) and bow to His (Will), before the Penalty comes on you: after that ye shall not be helped.

source: واتبعوا أحسن ما أنزل إليكم من ربكم من قبل أن يأتيكم العذاب بغتة وأنتم لا تشعرون
en: "And follow the best of (the courses) revealed to you from your Lord, before the Penalty comes on you - of a sudden while ye perceive not!-

source: أن تقول نفس يا حسرتا على ما فرطت في جنب الله وإن كنت لمن الساخرين
en: "Lest the soul should (then) say: 'Ah! Woe is me!- In that I neglected (my duty) towards Allah, and was but among those who mocked!'-

source: أو تقول لو أن الله هداني لكنت من المتقين
en: "Or (lest) it should say: 'If only Allah had guided me, I should certainly have been among the righteous!'-

source: أو تقول حين ترى العذاب لو أن لي كرة فأكون من المحسنين
en: "Or (lest) it should say when it (actually) sees the penalty: 'If only I had another chance, I should certainly be among those who do good!'

source: بلى قد جاءتك آياتي فكذبت بها واستكبرت وكنت من الكافرين
en: "(The reply will be:) 'Nay, but there came to thee my Signs, and thou didst reject them: thou wast Haughty, and became one of those who reject faith!'"

source: ويوم القيامة ترى الذين كذبوا على الله وجوههم مسودة أليس في جهنم مثوى للمتكبرين
en: On the Day of Judgment wilt thou see those who told lies against Allah;- their faces will be turned black; Is there not in Hell an abode for the Haughty?

source: وينجي الله الذين اتقوا بمفازتهم لا يمسهم السوء ولا هم يحزنون
en: But Allah will deliver the righteous to their place of salvation: no evil shall touch them, nor shall they grieve.

source: الله خالق كل شيء وهو على كل شيء وكيل
en: Allah is the Creator of all things, and He is the Guardian and Disposer of all affairs.

source: له مقاليد السماوات والأرض والذين كفروا بآيات الله أولئك هم الخاسرون
en: To Him belong the keys of the heavens and the earth: and those who reject the Signs of Allah,- it is they who will be in loss.

source: قل أفغير الله تأمروني أعبد أيها الجاهلون
en: Say: "Is it some one other than Allah that ye order me to worship, O ye ignorant ones?"

source: ولقد أوحي إليك وإلى الذين من قبلك لئن أشركت ليحبطن عملك ولتكونن من الخاسرين
en: But it has already been revealed to thee,- as it was to those before thee,- "If thou wert to join (gods with Allah), truly fruitless will be thy work (in life), and thou wilt surely be in the ranks of those who lose (all spiritual good)".

source: بل الله فاعبد وكن من الشاكرين
en: Nay, but worship Allah, and be of those who give thanks.

source: وما قدروا الله حق قدره والأرض جميعا قبضته يوم القيامة والسماوات مطويات بيمينه سبحانه وتعالى عما يشركون
en: No just estimate have they made of Allah, such as is due to Him: On the Day of Judgment the whole of the earth will be but His handful, and the heavens will be rolled up in His right hand: Glory to Him! High is He above the Partners they attribute to Him!

source: ونفخ في الصور فصعق من في السماوات ومن في الأرض إلا من شاء الله ثم نفخ فيه أخرى فإذا هم قيام ينظرون
en: The Trumpet will (just) be sounded, when all that are in the heavens and on earth will swoon, except such as it will please Allah (to exempt). Then will a second one be sounded, when, behold, they will be standing and looking on!

source: وأشرقت الأرض بنور ربها ووضع الكتاب وجيء بالنبيين والشهداء وقضي بينهم بالحق وهم لا يظلمون
en: And the Earth will shine with the Glory of its Lord: the Record (of Deeds) will be placed (open); the prophets and the witnesses will be brought forward and a just decision pronounced between them; and they will not be wronged (in the least).

source: ووفيت كل نفس ما عملت وهو أعلم بما يفعلون
en: And to every soul will be paid in full (the fruit) of its Deeds; and (Allah) knoweth best all that they do.

source: وسيق الذين كفروا إلى جهنم زمرا حتى إذا جاءوها فتحت أبوابها وقال لهم خزنتها ألم يأتكم رسل منكم يتلون عليكم آيات ربكم وينذرونكم لقاء يومكم هذا قالوا بلى ولكن حقت كلمة العذاب على الكافرين
en: The Unbelievers will be led to Hell in crowd: until, when they arrive, there, its gates will be opened. And its keepers will say, "Did not messengers come to you from among yourselves, rehearsing to you the Signs of your Lord, and warning you of the Meeting of This Day of yours?" The answer will be: "True: but the Decree of Punishment has been proved true against the Unbelievers!"

source: قيل ادخلوا أبواب جهنم خالدين فيها فبئس مثوى المتكبرين
en: (To them) will be said: "Enter ye the gates of Hell, to dwell therein: and evil is (this) Abode of the Arrogant!"

source: وسيق الذين اتقوا ربهم إلى الجنة زمرا حتى إذا جاءوها وفتحت أبوابها وقال لهم خزنتها سلام عليكم طبتم فادخلوها خالدين
en: And those who feared their Lord will be led to the Garden in crowds: until behold, they arrive there; its gates will be opened; and its keepers will say: "Peace be upon you! well have ye done! enter ye here, to dwell therein."

source: وقالوا الحمد لله الذي صدقنا وعده وأورثنا الأرض نتبوأ من الجنة حيث نشاء فنعم أجر العاملين
en: They will say: "Praise be to Allah, Who has truly fulfilled His Promise to us, and has given us (this) land in heritage: We can dwell in the Garden as we will: how excellent a reward for those who work (righteousness)!"

source: وترى الملائكة حافين من حول العرش يسبحون بحمد ربهم وقضي بينهم بالحق وقيل الحمد لله رب العالمين
en: And thou wilt see the angels surrounding the Throne (Divine) on all sides, singing Glory and Praise to their Lord. The Decision between them (at Judgment) will be in (perfect) justice, and the cry (on all sides) will be, "Praise be to Allah, the Lord of the Worlds!"

source: حم
en: Ha Mim

source: تنزيل الكتاب من الله العزيز العليم
en: The revelation of this Book is from Allah, Exalted in Power, Full of Knowledge,-

source: غافر الذنب وقابل التوب شديد العقاب ذي الطول لا إله إلا هو إليه المصير
en: Who forgiveth sin, accepteth repentance, is strict in punishment, and hath a long reach (in all things). there is no god but He: to Him is the final goal.

source: ما يجادل في آيات الله إلا الذين كفروا فلا يغررك تقلبهم في البلاد
en: None can dispute about the Signs of Allah but the Unbelievers. Let not, then, their strutting about through the land deceive thee!

source: كذبت قبلهم قوم نوح والأحزاب من بعدهم وهمت كل أمة برسولهم ليأخذوه وجادلوا بالباطل ليدحضوا به الحق فأخذتهم فكيف كان عقاب
en: But (there were people) before them, who denied (the Signs),- the People of Noah, and the Confederates (of Evil) after them; and every People plotted against their prophet, to seize him, and disputed by means of vanities, therewith to condemn the Truth; but it was I that seized them! and how (terrible) was My Requital!

source: وكذلك حقت كلمت ربك على الذين كفروا أنهم أصحاب النار
en: Thus was the Decree of thy Lord proved true against the Unbelievers; that truly they are Companions of the Fire!

source: الذين يحملون العرش ومن حوله يسبحون بحمد ربهم ويؤمنون به ويستغفرون للذين آمنوا ربنا وسعت كل شيء رحمة وعلما فاغفر للذين تابوا واتبعوا سبيلك وقهم عذاب الجحيم
en: Those who sustain the Throne (of Allah) and those around it Sing Glory and Praise to their Lord; believe in Him; and implore Forgiveness for those who believe: "Our Lord! Thy Reach is over all things, in Mercy and Knowledge. Forgive, then, those who turn in Repentance, and follow Thy Path; and preserve them from the Penalty of the Blazing Fire!

source: ربنا وأدخلهم جنات عدن التي وعدتهم ومن صلح من آبائهم وأزواجهم وذرياتهم إنك أنت العزيز الحكيم
en: "And grant, our Lord! that they enter the Gardens of Eternity, which Thou hast promised to them, and to the righteous among their fathers, their wives, and their posterity! For Thou art (He), the Exalted in Might, Full of Wisdom.

source: وقهم السيئات ومن تق السيئات يومئذ فقد رحمته وذلك هو الفوز العظيم
en: "And preserve them from (all) ills; and any whom Thou dost preserve from ills that Day,- on them wilt Thou have bestowed Mercy indeed: and that will be truly (for them) the highest Achievement".

source: إن الذين كفروا ينادون لمقت الله أكبر من مقتكم أنفسكم إذ تدعون إلى الإيمان فتكفرون
en: The Unbelievers will be addressed: "Greater was the aversion of Allah to you than (is) your aversion to yourselves, seeing that ye were called to the Faith and ye used to refuse."

source: قالوا ربنا أمتنا اثنتين وأحييتنا اثنتين فاعترفنا بذنوبنا فهل إلى خروج من سبيل
en: They will say: "Our Lord! twice hast Thou made us without life, and twice hast Thou given us Life! Now have we recognised our sins: Is there any way out (of this)?"

source: ذلكم بأنه إذا دعي الله وحده كفرتم وإن يشرك به تؤمنوا فالحكم لله العلي الكبير
en: (The answer will be:) "This is because, when Allah was invoked as the Only (object of worship), ye did reject Faith, but when partners were joined to Him, ye believed! the Command is with Allah, Most High, Most Great!"

source: هو الذي يريكم آياته وينزل لكم من السماء رزقا وما يتذكر إلا من ينيب
en: He it is Who showeth you his Signs, and sendeth down sustenance for you from the sky: but only those receive admonition who turn (to Allah).

source: فادعوا الله مخلصين له الدين ولو كره الكافرون
en: Call ye, then, upon Allah with sincere devotion to Him, even though the Unbelievers may detest it.

source: رفيع الدرجات ذو العرش يلقي الروح من أمره على من يشاء من عباده لينذر يوم التلاق
en: Raised high above ranks (or degrees), (He is) the Lord of the Throne (of Authority): by His Command doth He send the Spirit (of inspiration) to any of His servants he pleases, that it may warn (men) of the Day of Mutual Meeting,-

source: يوم هم بارزون لا يخفى على الله منهم شيء لمن الملك اليوم لله الواحد القهار
en: The Day whereon they will (all) come forth: not a single thing concerning them is hidden from Allah. Whose will be the dominion that Day?" That of Allah, the One the Irresistible!

source: اليوم تجزى كل نفس بما كسبت لا ظلم اليوم إن الله سريع الحساب
en: That Day will every soul be requited for what it earned; no injustice will there be that Day, for Allah is Swift in taking account.

source: وأنذرهم يوم الآزفة إذ القلوب لدى الحناجر كاظمين ما للظالمين من حميم ولا شفيع يطاع
en: Warn them of the Day that is (ever) drawing near, when the hearts will (come) right up to the throats to choke (them); No intimate friend nor intercessor will the wrong-doers have, who could be listened to.

source: يعلم خائنة الأعين وما تخفي الصدور
en: (Allah) knows of (the tricks) that deceive with the eyes, and all that the hearts (of men) conceal.

source: والله يقضي بالحق والذين يدعون من دونه لا يقضون بشيء إن الله هو السميع البصير
en: And Allah will judge with (justice and) Truth: but those whom (men) invoke besides Him, will not (be in a position) to judge at all. Verily it is Allah (alone) Who hears and sees (all things).

source: أولم يسيروا في الأرض فينظروا كيف كان عاقبة الذين كانوا من قبلهم كانوا هم أشد منهم قوة وآثارا في الأرض فأخذهم الله بذنوبهم وما كان لهم من الله من واق
en: Do they not travel through the earth and see what was the End of those before them? They were even superior to them in strength, and in the traces (they have left) in the land: but Allah did call them to account for their sins, and none had they to defend them against Allah.

source: ذلك بأنهم كانت تأتيهم رسلهم بالبينات فكفروا فأخذهم الله إنه قوي شديد العقاب
en: That was because there came to them their messengers with Clear (Signs), but they rejected them: So Allah called them to account: for He is Full of Strength, Strict in Punishment.

source: إلى فرعون وهامان وقارون فقالوا ساحر كذاب
en: To Pharaoh, Haman, and Qarun; but they called (him)" a sorcerer telling lies!"...

source: فلما جاءهم بالحق من عندنا قالوا اقتلوا أبناء الذين آمنوا معه واستحيوا نساءهم وما كيد الكافرين إلا في ضلال
en: Now, when he came to them in Truth, from Us, they said, "Slay the sons of those who believe with him, and keep alive their females," but the plots of Unbelievers (end) in nothing but errors (and delusions)!...

source: وقال فرعون ذروني أقتل موسى وليدع ربه إني أخاف أن يبدل دينكم أو أن يظهر في الأرض الفساد
en: Said Pharaoh: "Leave me to slay Moses; and let him call on his Lord! What I fear is lest he should change your religion, or lest he should cause mischief to appear in the land!"

source: وقال موسى إني عذت بربي وربكم من كل متكبر لا يؤمن بيوم الحساب
en: Moses said: "I have indeed called upon my Lord and your Lord (for protection) from every arrogant one who believes not in the Day of Account!"

source: وقال رجل مؤمن من آل فرعون يكتم إيمانه أتقتلون رجلا أن يقول ربي الله وقد جاءكم بالبينات من ربكم وإن يك كاذبا فعليه كذبه وإن يك صادقا يصبكم بعض الذي يعدكم إن الله لا يهدي من هو مسرف كذاب
en: A believer, a man from among the people of Pharaoh, who had concealed his faith, said: "Will ye slay a man because he says, 'My Lord is Allah'?- when he has indeed come to you with Clear (Signs) from your Lord? and if he be a liar, on him is (the sin of) his lie: but, if he is telling the Truth, then will fall on you something of the (calamity) of which he warns you: Truly Allah guides not one who transgresses and lies!

source: يا قوم لكم الملك اليوم ظاهرين في الأرض فمن ينصرنا من بأس الله إن جاءنا قال فرعون ما أريكم إلا ما أرى وما أهديكم إلا سبيل الرشاد
en: "O my People! Yours is the dominion this day: Ye have the upper hand in the land: but who will help us from the Punishment of Allah, should it befall us?" Pharaoh said: "I but point out to you that which I see (myself); Nor do I guide you but to the Path of Right!"

source: وقال الذي آمن يا قوم إني أخاف عليكم مثل يوم الأحزاب
en: Then said the man who believed: "O my people! Truly I do fear for you something like the Day (of disaster) of the Confederates (in sin)!-

source: مثل دأب قوم نوح وعاد وثمود والذين من بعدهم وما الله يريد ظلما للعباد
en: "Something like the fate of the People of Noah, the 'Ad, and the Thamud, and those who came after them: but Allah never wishes injustice to his Servants.

source: ويا قوم إني أخاف عليكم يوم التناد
en: "And O my people! I fear for you a Day when there will be Mutual calling (and wailing),-

source: يوم تولون مدبرين ما لكم من الله من عاصم ومن يضلل الله فما له من هاد
en: "A Day when ye shall turn your backs and flee: No defender shall ye have from Allah: Any whom Allah leaves to stray, there is none to guide...

source: ولقد جاءكم يوسف من قبل بالبينات فما زلتم في شك مما جاءكم به حتى إذا هلك قلتم لن يبعث الله من بعده رسولا كذلك يضل الله من هو مسرف مرتاب
en: "And to you there came Joseph in times gone by, with Clear Signs, but ye ceased not to doubt of the (Mission) for which he had come: At length, when he died, ye said: 'No messenger will Allah send after him.' thus doth Allah leave to stray such as transgress and live in doubt,-

source: الذين يجادلون في آيات الله بغير سلطان أتاهم كبر مقتا عند الله وعند الذين آمنوا كذلك يطبع الله على كل قلب متكبر جبار
en: "(Such) as dispute about the Signs of Allah, without any authority that hath reached them, grievous and odious (is such conduct) in the sight of Allah and of the Believers. Thus doth Allah, seal up every heart - of arrogant and obstinate Transgressors."

source: وقال فرعون يا هامان ابن لي صرحا لعلي أبلغ الأسباب
en: Pharaoh said: "O Haman! Build me a lofty palace, that I may attain the ways and means-

source: أسباب السماوات فأطلع إلى إله موسى وإني لأظنه كاذبا وكذلك زين لفرعون سوء عمله وصد عن السبيل وما كيد فرعون إلا في تباب
en: "The ways and means of (reaching) the heavens, and that I may mount up to the god of Moses: But as far as I am concerned, I think (Moses) is a liar!" Thus was made alluring, in Pharaoh's eyes, the evil of his deeds, and he was hindered from the Path; and the plot of Pharaoh led to nothing but perdition (for him).

source: وقال الذي آمن يا قوم اتبعون أهدكم سبيل الرشاد
en: The man who believed said further: "O my people! Follow me: I will lead you to the Path of Right.

source: يا قوم إنما هذه الحياة الدنيا متاع وإن الآخرة هي دار القرار
en: "O my people! This life of the present is nothing but (temporary) convenience: It is the Hereafter that is the Home that will last.

source: من عمل سيئة فلا يجزى إلا مثلها ومن عمل صالحا من ذكر أو أنثى وهو مؤمن فأولئك يدخلون الجنة يرزقون فيها بغير حساب
en: "He that works evil will not be requited but by the like thereof: and he that works a righteous deed - whether man or woman - and is a Believer- such will enter the Garden (of Bliss): Therein will they have abundance without measure.

source: ويا قوم ما لي أدعوكم إلى النجاة وتدعونني إلى النار
en: "And O my people! How (strange) it is for me to call you to Salvation while ye call me to the Fire!

source: تدعونني لأكفر بالله وأشرك به ما ليس لي به علم وأنا أدعوكم إلى العزيز الغفار
en: "Ye do call upon me to blaspheme against Allah, and to join with Him partners of whom I have no knowledge; and I call you to the Exalted in Power, Who forgives again and again!"

source: لا جرم أنما تدعونني إليه ليس له دعوة في الدنيا ولا في الآخرة وأن مردنا إلى الله وأن المسرفين هم أصحاب النار
en: "Without doubt ye do call me to one who is not fit to be called to, whether in this world, or in the Hereafter; our return will be to Allah; and the Transgressors will be Companions of the Fire!

source: فستذكرون ما أقول لكم وأفوض أمري إلى الله إن الله بصير بالعباد
en: "Soon will ye remember what I say to you (now), My (own) affair I commit to Allah: for Allah (ever) watches over His Servants."

source: فوقاه الله سيئات ما مكروا وحاق بآل فرعون سوء العذاب
en: Then Allah saved him from (every) ill that they plotted (against him), but the burnt of the Penalty encompassed on all sides the People of Pharaoh.

source: النار يعرضون عليها غدوا وعشيا ويوم تقوم الساعة أدخلوا آل فرعون أشد العذاب
en: In front of the Fire will they be brought, morning and evening: And (the sentence will be) on the Day that Judgment will be established: "Cast ye the People of Pharaoh into the severest Penalty!"

source: وإذ يتحاجون في النار فيقول الضعفاء للذين استكبروا إنا كنا لكم تبعا فهل أنتم مغنون عنا نصيبا من النار
en: Behold, they will dispute with each other in the Fire! The weak ones (who followed) will say to those who had been arrogant, "We but followed you: Can ye then take (on yourselves) from us some share of the Fire?

source: قال الذين استكبروا إنا كل فيها إن الله قد حكم بين العباد
en: Those who had been arrogant will say: "We are all in this (Fire)! Truly, Allah has judged between (his) Servants!"

source: وقال الذين في النار لخزنة جهنم ادعوا ربكم يخفف عنا يوما من العذاب
en: Those in the Fire will say to the Keepers of Hell: "Pray to your Lord to lighten us the Penalty for a day (at least)!"

source: قالوا أولم تك تأتيكم رسلكم بالبينات قالوا بلى قالوا فادعوا وما دعاء الكافرين إلا في ضلال
en: They will say: "Did there not come to you your messengers with Clear Signs?" They will say, "Yes". They will reply, "Then pray (as ye like)! But the prayer of those without Faith is nothing but (futile wandering) in (mazes of) error!"

source: إنا لننصر رسلنا والذين آمنوا في الحياة الدنيا ويوم يقوم الأشهاد
en: We will, without doubt, help our messengers and those who believe, (both) in this world's life and on the Day when the Witnesses will stand forth,-

source: يوم لا ينفع الظالمين معذرتهم ولهم اللعنة ولهم سوء الدار
en: The Day when no profit will it be to Wrong-doers to present their excuses, but they will (only) have the Curse and the Home of Misery.

source: ولقد آتينا موسى الهدى وأورثنا بني إسرائيل الكتاب
en: We did aforetime give Moses the (Book of) Guidance, and We gave the book in inheritance to the Children of Israel,-

source: هدى وذكرى لأولي الألباب
en: A Guide and a Message to men of Understanding.

source: فاصبر إن وعد الله حق واستغفر لذنبك وسبح بحمد ربك بالعشي والإبكار
en: Patiently, then, persevere: for the Promise of Allah is true: and ask forgiveness for thy fault, and celebrate the Praises of thy Lord in the evening and in the morning.

source: إن الذين يجادلون في آيات الله بغير سلطان أتاهم إن في صدورهم إلا كبر ما هم ببالغيه فاستعذ بالله إنه هو السميع البصير
en: Those who dispute about the signs of Allah without any authority bestowed on them,- there is nothing in their breasts but (the quest of) greatness, which they shall never attain to: seek refuge, then, in Allah: It is He Who hears and sees (all things).

source: لخلق السماوات والأرض أكبر من خلق الناس ولكن أكثر الناس لا يعلمون
en: Assuredly the creation of the heavens and the earth is a greater (matter) than the creation of men: Yet most men understand not.

source: وما يستوي الأعمى والبصير والذين آمنوا وعملوا الصالحات ولا المسيء قليلا ما تتذكرون
en: Not equal are the blind and those who (clearly) see: Nor are (equal) those who believe and work deeds of righteousness, and those who do evil. Little do ye learn by admonition!

source: إن الساعة لآتية لا ريب فيها ولكن أكثر الناس لا يؤمنون
en: The Hour will certainly come: Therein is no doubt: Yet most men believe not.

source: وقال ربكم ادعوني أستجب لكم إن الذين يستكبرون عن عبادتي سيدخلون جهنم داخرين
en: And your Lord says: "Call on Me; I will answer your (Prayer): but those who are too arrogant to serve Me will surely find themselves in Hell - in humiliation!"

source: الله الذي جعل لكم الليل لتسكنوا فيه والنهار مبصرا إن الله لذو فضل على الناس ولكن أكثر الناس لا يشكرون
en: It is Allah Who has made the Night for you, that ye may rest therein, and the days as that which helps (you) to see. Verily Allah is full of Grace and Bounty to men: yet most men give no thanks.

source: ذلكم الله ربكم خالق كل شيء لا إله إلا هو فأنى تؤفكون
en: Such is Allah, your Lord, the Creator of all things, there is no god but He: Then how ye are deluded away from the Truth!

source: كذلك يؤفك الذين كانوا بآيات الله يجحدون
en: Thus are deluded those who are wont to reject the Signs of Allah.
